## Адресное пространство 
## Data Center 1 POD 1

1. За основу берем сеть класса A. 10.0.0.0/8
2. 2-ой байт 5-6 бит № дата цетра (0-16) 1-4 бит резерв.
3. 3-ий байт 6-8 бит № POD, 4 байт тип объекта 0 - Leaf, 1 - Spine, 1-4 бит № объекта (возможно 16 объектов каждого типа).
4. Адреса для Loopback X.X.X.250/32 ..... X.X.X.255/32

	Выделение сетей для ЦОД 1 POD 1 согласно схеме коммутации.								
									
Коммутатор	Lo0	               mngmnt_1	           Spine-1	       Spine-2	       Server-1	      Server-2	    Server-3	    Server-4
1	Spine-1  	10.16.17.250/32	   192.168.100.17/24						
2	Spine-2 	10.16.18.250/32	   192.168.100.18/24						
3	Leaf-1  	10.16.1.250/32	   192.168.100.1/24	   10.16.17.10/31	 10.16.18.10/31	  10.16.1.0/30			
4	Leaf-2	  10.16.2.250/32	   192.168.100.2/24	   10.16.17.12/31	 10.16.18.12/31		              10.16.2.0/30		
5	Leaf-3	  10.16.3.250/32	   192.168.100.3/24	   10.16.17.14/31	 10.16.18.14/31			                           10.16.3.0/30	 10.16.3.4/30


